module @train_epoch_compiled {
  func.func public @jit_train_epoch_compiled(%arg0: tensor<4x8x3xf32>, %arg1: tensor<f32>, %arg2: tensor<f32>, %arg3: tensor<i32>, %arg4: tensor<2xui32>, %arg5: tensor<96x8xf32>, %arg6: tensor<96xf32>, %arg7: tensor<96xf32>) -> (tensor<4x8x3xf32>, tensor<f32>, tensor<f32>, tensor<i32>, tensor<2xui32>, tensor<2xf64>) attributes {llvm.emit_c_interface} {
    %c32 = arith.constant 32 : index
    %c1 = arith.constant 1 : index
    %c3 = arith.constant 3 : index
    %c0 = arith.constant 0 : index
    %cst = stablehlo.constant dense<3.000000e+00> : tensor<f64>
    %cst_0 = stablehlo.constant dense<3.200000e+01> : tensor<f64>
    %c = stablehlo.constant dense<32> : tensor<i64>
    %cst_1 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %cst_2 = stablehlo.constant dense<0.000000e+00> : tensor<f64>
    %cst_3 = stablehlo.constant dense<0.00999999977> : tensor<f32>
    %cst_4 = stablehlo.constant dense<3.125000e-02> : tensor<f32>
    %c_5 = stablehlo.constant dense<96> : tensor<i64>
    %c_6 = stablehlo.constant dense<0> : tensor<i64>
    %0 = call @_threefry_split(%arg4) : (tensor<2xui32>) -> tensor<2x2xui32>
    %1 = stablehlo.slice %0 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %2 = stablehlo.reshape %1 : (tensor<1x2xui32>) -> tensor<2xui32>
    %3 = stablehlo.slice %0 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %4 = stablehlo.reshape %3 : (tensor<1x2xui32>) -> tensor<2xui32>
    %5 = call @_randint(%4, %c_6, %c_5) : (tensor<2xui32>, tensor<i64>, tensor<i64>) -> tensor<i64>
    %6:6 = scf.for %arg8 = %c0 to %c3 step %c1 iter_args(%arg9 = %arg0, %arg10 = %arg1, %arg11 = %arg2, %arg12 = %arg3, %arg13 = %cst_2, %arg14 = %cst_2) -> (tensor<4x8x3xf32>, tensor<f32>, tensor<f32>, tensor<i32>, tensor<f64>, tensor<f64>) {
      %11 = arith.index_cast %arg8 : index to i64
      %from_elements = tensor.from_elements %11 : tensor<i64>
      %12 = stablehlo.broadcast_in_dim %cst_1, dims = [] : (tensor<f32>) -> tensor<4x8x3xf32>
      %13:4 = scf.for %arg15 = %c0 to %c32 step %c1 iter_args(%arg16 = %12, %arg17 = %cst_2, %arg18 = %cst_2, %arg19 = %cst_2) -> (tensor<4x8x3xf32>, tensor<f64>, tensor<f64>, tensor<f64>) {
        %31 = arith.index_cast %arg15 : index to i64
        %from_elements_7 = tensor.from_elements %31 : tensor<i64>
        %32 = stablehlo.multiply %from_elements, %c : tensor<i64>
        %33 = stablehlo.convert %32 : tensor<i64>
        %34 = stablehlo.add %5, %33 : tensor<i64>
        %35 = stablehlo.convert %from_elements_7 : tensor<i64>
        %36 = stablehlo.add %34, %35 : tensor<i64>
        %37 = func.call @remainder(%36, %c_5) : (tensor<i64>, tensor<i64>) -> tensor<i64>
        %38 = stablehlo.compare  LT, %37, %c_6,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
        %39 = stablehlo.add %37, %c_5 : tensor<i64>
        %40 = stablehlo.select %38, %39, %37 : tensor<i1>, tensor<i64>
        %41 = stablehlo.dynamic_slice %arg5, %40, %c_6, sizes = [1, 8] : (tensor<96x8xf32>, tensor<i64>, tensor<i64>) -> tensor<1x8xf32>
        %42 = stablehlo.reshape %41 : (tensor<1x8xf32>) -> tensor<8xf32>
        %43 = stablehlo.compare  LT, %37, %c_6,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
        %44 = stablehlo.add %37, %c_5 : tensor<i64>
        %45 = stablehlo.select %43, %44, %37 : tensor<i1>, tensor<i64>
        %46 = stablehlo.dynamic_slice %arg6, %45, sizes = [1] : (tensor<96xf32>, tensor<i64>) -> tensor<1xf32>
        %47 = stablehlo.reshape %46 : (tensor<1xf32>) -> tensor<f32>
        %48 = stablehlo.compare  LT, %37, %c_6,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
        %49 = stablehlo.add %37, %c_5 : tensor<i64>
        %50 = stablehlo.select %48, %49, %37 : tensor<i1>, tensor<i64>
        %51 = stablehlo.dynamic_slice %arg7, %50, sizes = [1] : (tensor<96xf32>, tensor<i64>) -> tensor<1xf32>
        %52 = stablehlo.reshape %51 : (tensor<1xf32>) -> tensor<f32>
        %53 = func.call @qnode_forward_0(%arg9, %42) : (tensor<4x8x3xf32>, tensor<8xf32>) -> tensor<f64>
        %54 = stablehlo.convert %arg11 : (tensor<f32>) -> tensor<f64>
        %55 = stablehlo.multiply %54, %53 : tensor<f64>
        %56 = stablehlo.convert %arg10 : (tensor<f32>) -> tensor<f64>
        %57 = stablehlo.add %55, %56 : tensor<f64>
        %58 = stablehlo.convert %47 : (tensor<f32>) -> tensor<f64>
        %59 = stablehlo.convert %52 : (tensor<f32>) -> tensor<f64>
        %60 = func.call @softplus(%57) : (tensor<f64>) -> tensor<f64>
        %61 = stablehlo.multiply %58, %57 : tensor<f64>
        %62 = stablehlo.subtract %60, %61 : tensor<f64>
        %63 = stablehlo.multiply %59, %62 : tensor<f64>
        %64:3 = gradient.grad "auto" @_sample_loss(%arg9, %arg10, %arg11, %42, %47, %52) {diffArgIndices = dense<[0, 1, 2]> : tensor<3xi64>} : (tensor<4x8x3xf32>, tensor<f32>, tensor<f32>, tensor<8xf32>, tensor<f32>, tensor<f32>) -> (tensor<4x8x3xf32>, tensor<f32>, tensor<f32>)
        %65 = stablehlo.add %arg16, %64#0 : tensor<4x8x3xf32>
        %66 = stablehlo.convert %64#1 : (tensor<f32>) -> tensor<f64>
        %67 = stablehlo.add %arg17, %66 : tensor<f64>
        %68 = stablehlo.convert %64#2 : (tensor<f32>) -> tensor<f64>
        %69 = stablehlo.add %arg18, %68 : tensor<f64>
        %70 = stablehlo.add %arg19, %63 : tensor<f64>
        scf.yield %65, %67, %69, %70 : tensor<4x8x3xf32>, tensor<f64>, tensor<f64>, tensor<f64>
      }
      %14 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<4x8x3xf32>
      %15 = stablehlo.multiply %13#0, %14 : tensor<4x8x3xf32>
      %16 = stablehlo.broadcast_in_dim %cst_3, dims = [] : (tensor<f32>) -> tensor<4x8x3xf32>
      %17 = stablehlo.multiply %16, %15 : tensor<4x8x3xf32>
      %18 = stablehlo.subtract %arg9, %17 : tensor<4x8x3xf32>
      %19 = stablehlo.convert %cst_4 : (tensor<f32>) -> tensor<f64>
      %20 = stablehlo.multiply %13#1, %19 : tensor<f64>
      %21 = stablehlo.convert %20 : (tensor<f64>) -> tensor<f32>
      %22 = stablehlo.multiply %cst_3, %21 : tensor<f32>
      %23 = stablehlo.subtract %arg10, %22 : tensor<f32>
      %24 = stablehlo.convert %cst_4 : (tensor<f32>) -> tensor<f64>
      %25 = stablehlo.multiply %13#2, %24 : tensor<f64>
      %26 = stablehlo.convert %25 : (tensor<f64>) -> tensor<f32>
      %27 = stablehlo.multiply %cst_3, %26 : tensor<f32>
      %28 = stablehlo.subtract %arg11, %27 : tensor<f32>
      %29 = stablehlo.divide %13#3, %cst_0 : tensor<f64>
      %30 = stablehlo.add %arg13, %29 : tensor<f64>
      scf.yield %18, %23, %28, %arg12, %30, %29 : tensor<4x8x3xf32>, tensor<f32>, tensor<f32>, tensor<i32>, tensor<f64>, tensor<f64>
    }
    %7 = stablehlo.divide %6#4, %cst : tensor<f64>
    %8 = stablehlo.broadcast_in_dim %7, dims = [] : (tensor<f64>) -> tensor<1xf64>
    %9 = stablehlo.broadcast_in_dim %6#5, dims = [] : (tensor<f64>) -> tensor<1xf64>
    %10 = stablehlo.concatenate %8, %9, dim = 0 : (tensor<1xf64>, tensor<1xf64>) -> tensor<2xf64>
    return %6#0, %6#1, %6#2, %6#3, %2, %10 : tensor<4x8x3xf32>, tensor<f32>, tensor<f32>, tensor<i32>, tensor<2xui32>, tensor<2xf64>
  }
  func.func private @_threefry_split(%arg0: tensor<2xui32>) -> tensor<2x2xui32> attributes {llvm.linkage = #llvm.linkage<internal>} {
    %c = stablehlo.constant dense<1> : tensor<i64>
    %c_0 = stablehlo.constant dense<5> : tensor<i64>
    %c_1 = stablehlo.constant dense<0> : tensor<i64>
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32>
    %c_3 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32>
    %c_4 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32>
    %c_5 = stablehlo.constant dense<32> : tensor<ui64>
    %c_6 = stablehlo.constant dense<1> : tensor<ui64>
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32>
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32>
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32>
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32>
    %4 = stablehlo.iota dim = 0 : tensor<2xui64>
    %5 = stablehlo.broadcast_in_dim %c_6, dims = [] : (tensor<ui64>) -> tensor<2xui64>
    %6 = stablehlo.multiply %5, %4 : tensor<2xui64>
    %7 = stablehlo.broadcast_in_dim %c_5, dims = [] : (tensor<ui64>) -> tensor<2xui64>
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<2xui64>
    %9 = stablehlo.convert %6 : (tensor<2xui64>) -> tensor<2xui32>
    %10 = stablehlo.convert %8 : (tensor<2xui64>) -> tensor<2xui32>
    %11 = stablehlo.xor %1, %3 : tensor<ui32>
    %12 = stablehlo.xor %11, %c_2 : tensor<ui32>
    %13 = stablehlo.broadcast_in_dim %1, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %14 = stablehlo.add %10, %13 : tensor<2xui32>
    %15 = stablehlo.broadcast_in_dim %3, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %16 = stablehlo.add %9, %15 : tensor<2xui32>
    %17:9 = stablehlo.while(%iterArg = %c_1, %iterArg_7 = %c_1, %iterArg_8 = %14, %iterArg_9 = %16, %iterArg_10 = %3, %iterArg_11 = %12, %iterArg_12 = %1, %iterArg_13 = %c_4, %iterArg_14 = %c_3) : tensor<i64>, tensor<i64>, tensor<2xui32>, tensor<2xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %21 = stablehlo.compare  LT, %iterArg, %c_0,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
      stablehlo.return %21 : tensor<i1>
    } do {
      %21:8 = func.call @closed_call(%iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12, %iterArg_13, %iterArg_14) : (tensor<i64>, tensor<2xui32>, tensor<2xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i64>, tensor<2xui32>, tensor<2xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>)
      %22 = stablehlo.add %iterArg, %c : tensor<i64>
      stablehlo.return %22, %21#0, %21#1, %21#2, %21#3, %21#4, %21#5, %21#6, %21#7 : tensor<i64>, tensor<i64>, tensor<2xui32>, tensor<2xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    }
    %18 = stablehlo.broadcast_in_dim %17#2, dims = [0] : (tensor<2xui32>) -> tensor<2x1xui32>
    %19 = stablehlo.broadcast_in_dim %17#3, dims = [0] : (tensor<2xui32>) -> tensor<2x1xui32>
    %20 = stablehlo.concatenate %18, %19, dim = 1 : (tensor<2x1xui32>, tensor<2x1xui32>) -> tensor<2x2xui32>
    return %20 : tensor<2x2xui32>
  }
  func.func private @closed_call(%arg0: tensor<i64>, %arg1: tensor<2xui32>, %arg2: tensor<2xui32>, %arg3: tensor<ui32>, %arg4: tensor<ui32>, %arg5: tensor<ui32>, %arg6: tensor<4xui32>, %arg7: tensor<4xui32>) -> (tensor<i64>, tensor<2xui32>, tensor<2xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) attributes {llvm.linkage = #llvm.linkage<internal>} {
    %c = stablehlo.constant dense<32> : tensor<ui32>
    %c_0 = stablehlo.constant dense<1> : tensor<i64>
    %0 = stablehlo.add %arg0, %c_0 : tensor<i64>
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32>
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32>
    %3 = stablehlo.add %arg1, %arg2 : tensor<2xui32>
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %5 = stablehlo.shift_left %arg2, %4 : tensor<2xui32>
    %6 = stablehlo.subtract %c, %2 : tensor<ui32>
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<2xui32>
    %9 = stablehlo.or %5, %8 : tensor<2xui32>
    %10 = stablehlo.xor %3, %9 : tensor<2xui32>
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32>
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32>
    %13 = stablehlo.add %3, %10 : tensor<2xui32>
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %15 = stablehlo.shift_left %10, %14 : tensor<2xui32>
    %16 = stablehlo.subtract %c, %12 : tensor<ui32>
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<2xui32>
    %19 = stablehlo.or %15, %18 : tensor<2xui32>
    %20 = stablehlo.xor %13, %19 : tensor<2xui32>
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32>
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32>
    %23 = stablehlo.add %13, %20 : tensor<2xui32>
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %25 = stablehlo.shift_left %20, %24 : tensor<2xui32>
    %26 = stablehlo.subtract %c, %22 : tensor<ui32>
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<2xui32>
    %29 = stablehlo.or %25, %28 : tensor<2xui32>
    %30 = stablehlo.xor %23, %29 : tensor<2xui32>
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32>
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32>
    %33 = stablehlo.add %23, %30 : tensor<2xui32>
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %35 = stablehlo.shift_left %30, %34 : tensor<2xui32>
    %36 = stablehlo.subtract %c, %32 : tensor<ui32>
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<2xui32>
    %39 = stablehlo.or %35, %38 : tensor<2xui32>
    %40 = stablehlo.xor %33, %39 : tensor<2xui32>
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %42 = stablehlo.add %33, %41 : tensor<2xui32>
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %44 = stablehlo.add %40, %43 : tensor<2xui32>
    %45 = stablehlo.add %arg0, %c_0 : tensor<i64>
    %46 = stablehlo.convert %45 : (tensor<i64>) -> tensor<ui32>
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<2xui32>
    %48 = stablehlo.add %44, %47 : tensor<2xui32>
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i64>, tensor<2xui32>, tensor<2xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
  }
  func.func private @_randint(%arg0: tensor<2xui32>, %arg1: tensor<i64>, %arg2: tensor<i64>) -> tensor<i64> attributes {llvm.linkage = #llvm.linkage<internal>} {
    %c = stablehlo.constant dense<4294967296> : tensor<ui64>
    %c_0 = stablehlo.constant dense<1> : tensor<ui64>
    %c_1 = stablehlo.constant dense<32> : tensor<ui64>
    %c_2 = stablehlo.constant dense<1> : tensor<i64>
    %c_3 = stablehlo.constant dense<5> : tensor<i64>
    %c_4 = stablehlo.constant dense<0> : tensor<i64>
    %c_5 = stablehlo.constant dense<466688986> : tensor<ui32>
    %c_6 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32>
    %c_7 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32>
    %c_8 = stablehlo.constant dense<0> : tensor<ui32>
    %c_9 = stablehlo.constant dense<9223372036854775807> : tensor<i64>
    %c_10 = stablehlo.constant dense<-9223372036854775808> : tensor<i64>
    %0 = call @clip(%c_9, %c_10, %c_9) : (tensor<i64>, tensor<i64>, tensor<i64>) -> tensor<i64>
    %1 = stablehlo.compare  GT, %arg2, %0,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
    %2 = call @clip_0(%arg1, %c_10, %c_9) : (tensor<i64>, tensor<i64>, tensor<i64>) -> tensor<i64>
    %3 = stablehlo.convert %2 : tensor<i64>
    %4 = call @clip_0(%arg2, %c_10, %c_9) : (tensor<i64>, tensor<i64>, tensor<i64>) -> tensor<i64>
    %5 = stablehlo.convert %4 : tensor<i64>
    %6 = call @_threefry_split(%arg0) : (tensor<2xui32>) -> tensor<2x2xui32>
    %7 = stablehlo.slice %6 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %8 = stablehlo.reshape %7 : (tensor<1x2xui32>) -> tensor<2xui32>
    %9 = stablehlo.slice %6 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %10 = stablehlo.reshape %9 : (tensor<1x2xui32>) -> tensor<2xui32>
    %11 = stablehlo.slice %8 [0:1] : (tensor<2xui32>) -> tensor<1xui32>
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32>
    %13 = stablehlo.slice %8 [1:2] : (tensor<2xui32>) -> tensor<1xui32>
    %14 = stablehlo.reshape %13 : (tensor<1xui32>) -> tensor<ui32>
    %15 = stablehlo.xor %12, %14 : tensor<ui32>
    %16 = stablehlo.xor %15, %c_5 : tensor<ui32>
    %17 = stablehlo.add %c_8, %12 : tensor<ui32>
    %18 = stablehlo.add %c_8, %14 : tensor<ui32>
    %19:9 = stablehlo.while(%iterArg = %c_4, %iterArg_11 = %c_4, %iterArg_12 = %17, %iterArg_13 = %18, %iterArg_14 = %14, %iterArg_15 = %16, %iterArg_16 = %12, %iterArg_17 = %c_7, %iterArg_18 = %c_6) : tensor<i64>, tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %55 = stablehlo.compare  LT, %iterArg, %c_3,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
      stablehlo.return %55 : tensor<i1>
    } do {
      %55:8 = func.call @closed_call_1(%iterArg_11, %iterArg_12, %iterArg_13, %iterArg_14, %iterArg_15, %iterArg_16, %iterArg_17, %iterArg_18) : (tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>)
      %56 = stablehlo.add %iterArg, %c_2 : tensor<i64>
      stablehlo.return %56, %55#0, %55#1, %55#2, %55#3, %55#4, %55#5, %55#6, %55#7 : tensor<i64>, tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    }
    %20 = stablehlo.convert %19#2 : (tensor<ui32>) -> tensor<ui64>
    %21 = stablehlo.convert %19#3 : (tensor<ui32>) -> tensor<ui64>
    %22 = stablehlo.shift_left %20, %c_1 : tensor<ui64>
    %23 = stablehlo.or %22, %21 : tensor<ui64>
    %24 = stablehlo.slice %10 [0:1] : (tensor<2xui32>) -> tensor<1xui32>
    %25 = stablehlo.reshape %24 : (tensor<1xui32>) -> tensor<ui32>
    %26 = stablehlo.slice %10 [1:2] : (tensor<2xui32>) -> tensor<1xui32>
    %27 = stablehlo.reshape %26 : (tensor<1xui32>) -> tensor<ui32>
    %28 = stablehlo.xor %25, %27 : tensor<ui32>
    %29 = stablehlo.xor %28, %c_5 : tensor<ui32>
    %30 = stablehlo.add %c_8, %25 : tensor<ui32>
    %31 = stablehlo.add %c_8, %27 : tensor<ui32>
    %32:9 = stablehlo.while(%iterArg = %c_4, %iterArg_11 = %c_4, %iterArg_12 = %30, %iterArg_13 = %31, %iterArg_14 = %27, %iterArg_15 = %29, %iterArg_16 = %25, %iterArg_17 = %c_7, %iterArg_18 = %c_6) : tensor<i64>, tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %55 = stablehlo.compare  LT, %iterArg, %c_3,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
      stablehlo.return %55 : tensor<i1>
    } do {
      %55:8 = func.call @closed_call_1(%iterArg_11, %iterArg_12, %iterArg_13, %iterArg_14, %iterArg_15, %iterArg_16, %iterArg_17, %iterArg_18) : (tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>)
      %56 = stablehlo.add %iterArg, %c_2 : tensor<i64>
      stablehlo.return %56, %55#0, %55#1, %55#2, %55#3, %55#4, %55#5, %55#6, %55#7 : tensor<i64>, tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    }
    %33 = stablehlo.convert %32#2 : (tensor<ui32>) -> tensor<ui64>
    %34 = stablehlo.convert %32#3 : (tensor<ui32>) -> tensor<ui64>
    %35 = stablehlo.shift_left %33, %c_1 : tensor<ui64>
    %36 = stablehlo.or %35, %34 : tensor<ui64>
    %37 = stablehlo.subtract %5, %3 : tensor<i64>
    %38 = stablehlo.convert %37 : (tensor<i64>) -> tensor<ui64>
    %39 = stablehlo.compare  LE, %5, %3,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
    %40 = stablehlo.select %39, %c_0, %38 : tensor<i1>, tensor<ui64>
    %41 = stablehlo.compare  GT, %5, %3,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
    %42 = stablehlo.and %1, %41 : tensor<i1>
    %43 = stablehlo.add %40, %c_0 : tensor<ui64>
    %44 = stablehlo.select %42, %43, %40 : tensor<i1>, tensor<ui64>
    %45 = stablehlo.remainder %c, %44 : tensor<ui64>
    %46 = stablehlo.multiply %45, %45 : tensor<ui64>
    %47 = stablehlo.remainder %46, %44 : tensor<ui64>
    %48 = stablehlo.remainder %23, %44 : tensor<ui64>
    %49 = stablehlo.multiply %48, %47 : tensor<ui64>
    %50 = stablehlo.remainder %36, %44 : tensor<ui64>
    %51 = stablehlo.add %49, %50 : tensor<ui64>
    %52 = stablehlo.remainder %51, %44 : tensor<ui64>
    %53 = stablehlo.convert %52 : (tensor<ui64>) -> tensor<i64>
    %54 = stablehlo.add %3, %53 : tensor<i64>
    return %54 : tensor<i64>
  }
  func.func private @clip(%arg0: tensor<i64>, %arg1: tensor<i64>, %arg2: tensor<i64>) -> tensor<i64> attributes {llvm.linkage = #llvm.linkage<internal>} {
    %0 = stablehlo.maximum %arg1, %arg0 : tensor<i64>
    %1 = stablehlo.minimum %arg2, %0 : tensor<i64>
    return %1 : tensor<i64>
  }
  func.func private @clip_0(%arg0: tensor<i64>, %arg1: tensor<i64>, %arg2: tensor<i64>) -> tensor<i64> attributes {llvm.linkage = #llvm.linkage<internal>} {
    %0 = stablehlo.maximum %arg1, %arg0 : tensor<i64>
    %1 = stablehlo.minimum %arg2, %0 : tensor<i64>
    return %1 : tensor<i64>
  }
  func.func private @closed_call_1(%arg0: tensor<i64>, %arg1: tensor<ui32>, %arg2: tensor<ui32>, %arg3: tensor<ui32>, %arg4: tensor<ui32>, %arg5: tensor<ui32>, %arg6: tensor<4xui32>, %arg7: tensor<4xui32>) -> (tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) attributes {llvm.linkage = #llvm.linkage<internal>} {
    %c = stablehlo.constant dense<32> : tensor<ui32>
    %c_0 = stablehlo.constant dense<1> : tensor<i64>
    %0 = stablehlo.add %arg0, %c_0 : tensor<i64>
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32>
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32>
    %3 = stablehlo.add %arg1, %arg2 : tensor<ui32>
    %4 = stablehlo.shift_left %arg2, %2 : tensor<ui32>
    %5 = stablehlo.subtract %c, %2 : tensor<ui32>
    %6 = stablehlo.shift_right_logical %arg2, %5 : tensor<ui32>
    %7 = stablehlo.or %4, %6 : tensor<ui32>
    %8 = stablehlo.xor %3, %7 : tensor<ui32>
    %9 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32>
    %10 = stablehlo.reshape %9 : (tensor<1xui32>) -> tensor<ui32>
    %11 = stablehlo.add %3, %8 : tensor<ui32>
    %12 = stablehlo.shift_left %8, %10 : tensor<ui32>
    %13 = stablehlo.subtract %c, %10 : tensor<ui32>
    %14 = stablehlo.shift_right_logical %8, %13 : tensor<ui32>
    %15 = stablehlo.or %12, %14 : tensor<ui32>
    %16 = stablehlo.xor %11, %15 : tensor<ui32>
    %17 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32>
    %18 = stablehlo.reshape %17 : (tensor<1xui32>) -> tensor<ui32>
    %19 = stablehlo.add %11, %16 : tensor<ui32>
    %20 = stablehlo.shift_left %16, %18 : tensor<ui32>
    %21 = stablehlo.subtract %c, %18 : tensor<ui32>
    %22 = stablehlo.shift_right_logical %16, %21 : tensor<ui32>
    %23 = stablehlo.or %20, %22 : tensor<ui32>
    %24 = stablehlo.xor %19, %23 : tensor<ui32>
    %25 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32>
    %26 = stablehlo.reshape %25 : (tensor<1xui32>) -> tensor<ui32>
    %27 = stablehlo.add %19, %24 : tensor<ui32>
    %28 = stablehlo.shift_left %24, %26 : tensor<ui32>
    %29 = stablehlo.subtract %c, %26 : tensor<ui32>
    %30 = stablehlo.shift_right_logical %24, %29 : tensor<ui32>
    %31 = stablehlo.or %28, %30 : tensor<ui32>
    %32 = stablehlo.xor %27, %31 : tensor<ui32>
    %33 = stablehlo.add %27, %arg3 : tensor<ui32>
    %34 = stablehlo.add %32, %arg4 : tensor<ui32>
    %35 = stablehlo.add %arg0, %c_0 : tensor<i64>
    %36 = stablehlo.convert %35 : (tensor<i64>) -> tensor<ui32>
    %37 = stablehlo.add %34, %36 : tensor<ui32>
    return %0, %33, %37, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i64>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
  }
  func.func private @remainder(%arg0: tensor<i64>, %arg1: tensor<i64>) -> tensor<i64> attributes {llvm.linkage = #llvm.linkage<internal>} {
    %c = stablehlo.constant dense<1> : tensor<i64>
    %c_0 = stablehlo.constant dense<0> : tensor<i64>
    %0 = stablehlo.convert %arg1 : tensor<i64>
    %1 = stablehlo.compare  EQ, %0, %c_0,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
    %2 = call @_where(%1, %c, %0) : (tensor<i1>, tensor<i64>, tensor<i64>) -> tensor<i64>
    %3 = stablehlo.remainder %arg0, %2 : tensor<i64>
    %4 = stablehlo.compare  NE, %3, %c_0,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
    %5 = stablehlo.compare  LT, %3, %c_0,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
    %6 = stablehlo.compare  LT, %2, %c_0,  SIGNED : (tensor<i64>, tensor<i64>) -> tensor<i1>
    %7 = stablehlo.compare  NE, %5, %6,  UNSIGNED : (tensor<i1>, tensor<i1>) -> tensor<i1>
    %8 = stablehlo.and %7, %4 : tensor<i1>
    %9 = stablehlo.add %3, %2 : tensor<i64>
    %10 = stablehlo.select %8, %9, %3 : tensor<i1>, tensor<i64>
    return %10 : tensor<i64>
  }
  func.func private @_where(%arg0: tensor<i1>, %arg1: tensor<i64>, %arg2: tensor<i64>) -> tensor<i64> attributes {llvm.linkage = #llvm.linkage<internal>} {
    %0 = stablehlo.select %arg0, %arg1, %arg2 : tensor<i1>, tensor<i64>
    return %0 : tensor<i64>
  }
  func.func public @qnode_forward_0(%arg0: tensor<4x8x3xf32>, %arg1: tensor<8xf32>) -> tensor<f64> attributes {diff_method = "adjoint", llvm.linkage = #llvm.linkage<internal>, qnode} {
    %c0_i64 = arith.constant 0 : i64
    %cst = stablehlo.constant dense<3.14159274> : tensor<f32>
    %0 = stablehlo.slice %arg0 [3:4, 0:1, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %1 = stablehlo.reshape %0 : (tensor<1x1x1xf32>) -> tensor<f32>
    %2 = stablehlo.slice %arg0 [3:4, 0:1, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %3 = stablehlo.reshape %2 : (tensor<1x1x1xf32>) -> tensor<f32>
    %4 = stablehlo.slice %arg0 [3:4, 0:1, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %5 = stablehlo.reshape %4 : (tensor<1x1x1xf32>) -> tensor<f32>
    %6 = stablehlo.slice %arg0 [2:3, 0:1, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %7 = stablehlo.reshape %6 : (tensor<1x1x1xf32>) -> tensor<f32>
    %8 = stablehlo.slice %arg0 [2:3, 0:1, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %9 = stablehlo.reshape %8 : (tensor<1x1x1xf32>) -> tensor<f32>
    %10 = stablehlo.slice %arg0 [2:3, 0:1, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %11 = stablehlo.reshape %10 : (tensor<1x1x1xf32>) -> tensor<f32>
    %12 = stablehlo.slice %arg0 [1:2, 6:7, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %13 = stablehlo.reshape %12 : (tensor<1x1x1xf32>) -> tensor<f32>
    %14 = stablehlo.slice %arg0 [1:2, 6:7, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %15 = stablehlo.reshape %14 : (tensor<1x1x1xf32>) -> tensor<f32>
    %16 = stablehlo.slice %arg0 [1:2, 6:7, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %17 = stablehlo.reshape %16 : (tensor<1x1x1xf32>) -> tensor<f32>
    %18 = stablehlo.slice %arg0 [0:1, 7:8, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %19 = stablehlo.reshape %18 : (tensor<1x1x1xf32>) -> tensor<f32>
    %20 = stablehlo.slice %arg0 [0:1, 7:8, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %21 = stablehlo.reshape %20 : (tensor<1x1x1xf32>) -> tensor<f32>
    %22 = stablehlo.slice %arg0 [0:1, 7:8, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %23 = stablehlo.reshape %22 : (tensor<1x1x1xf32>) -> tensor<f32>
    %24 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<8xf32>
    %25 = stablehlo.multiply %24, %arg1 : tensor<8xf32>
    %26 = stablehlo.slice %25 [7:8] : (tensor<8xf32>) -> tensor<1xf32>
    %27 = stablehlo.reshape %26 : (tensor<1xf32>) -> tensor<f32>
    quantum.device shots(%c0_i64) ["/home/pichau/QAgents/.venv/lib/python3.12/site-packages/pennylane_lightning/liblightning_qubit_catalyst.so", "LightningSimulator", "{'mcmc': False, 'num_burnin': 0, 'kernel_name': None}"]
    %28 = quantum.alloc( 8) : !quantum.reg
    %29 = quantum.extract %28[ 7] : !quantum.reg -> !quantum.bit
    %30 = stablehlo.convert %27 : (tensor<f32>) -> tensor<f64>
    %extracted = tensor.extract %30[] : tensor<f64>
    %out_qubits = quantum.custom "RY"(%extracted) %29 : !quantum.bit
    %31 = stablehlo.convert %23 : (tensor<f32>) -> tensor<f64>
    %extracted_0 = tensor.extract %31[] : tensor<f64>
    %out_qubits_1 = quantum.custom "RZ"(%extracted_0) %out_qubits : !quantum.bit
    %32 = stablehlo.convert %21 : (tensor<f32>) -> tensor<f64>
    %extracted_2 = tensor.extract %32[] : tensor<f64>
    %out_qubits_3 = quantum.custom "RY"(%extracted_2) %out_qubits_1 : !quantum.bit
    %33 = stablehlo.convert %19 : (tensor<f32>) -> tensor<f64>
    %extracted_4 = tensor.extract %33[] : tensor<f64>
    %out_qubits_5 = quantum.custom "RZ"(%extracted_4) %out_qubits_3 : !quantum.bit
    %34 = stablehlo.slice %arg0 [0:1, 6:7, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %35 = stablehlo.reshape %34 : (tensor<1x1x1xf32>) -> tensor<f32>
    %36 = stablehlo.slice %arg0 [0:1, 6:7, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %37 = stablehlo.reshape %36 : (tensor<1x1x1xf32>) -> tensor<f32>
    %38 = stablehlo.slice %arg0 [0:1, 6:7, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %39 = stablehlo.reshape %38 : (tensor<1x1x1xf32>) -> tensor<f32>
    %40 = stablehlo.slice %25 [6:7] : (tensor<8xf32>) -> tensor<1xf32>
    %41 = stablehlo.reshape %40 : (tensor<1xf32>) -> tensor<f32>
    %42 = quantum.extract %28[ 6] : !quantum.reg -> !quantum.bit
    %43 = stablehlo.convert %41 : (tensor<f32>) -> tensor<f64>
    %extracted_6 = tensor.extract %43[] : tensor<f64>
    %out_qubits_7 = quantum.custom "RY"(%extracted_6) %42 : !quantum.bit
    %44 = stablehlo.convert %39 : (tensor<f32>) -> tensor<f64>
    %extracted_8 = tensor.extract %44[] : tensor<f64>
    %out_qubits_9 = quantum.custom "RZ"(%extracted_8) %out_qubits_7 : !quantum.bit
    %45 = stablehlo.convert %37 : (tensor<f32>) -> tensor<f64>
    %extracted_10 = tensor.extract %45[] : tensor<f64>
    %out_qubits_11 = quantum.custom "RY"(%extracted_10) %out_qubits_9 : !quantum.bit
    %46 = stablehlo.convert %35 : (tensor<f32>) -> tensor<f64>
    %extracted_12 = tensor.extract %46[] : tensor<f64>
    %out_qubits_13 = quantum.custom "RZ"(%extracted_12) %out_qubits_11 : !quantum.bit
    %47 = stablehlo.slice %arg0 [0:1, 5:6, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %48 = stablehlo.reshape %47 : (tensor<1x1x1xf32>) -> tensor<f32>
    %49 = stablehlo.slice %arg0 [0:1, 5:6, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %50 = stablehlo.reshape %49 : (tensor<1x1x1xf32>) -> tensor<f32>
    %51 = stablehlo.slice %arg0 [0:1, 5:6, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %52 = stablehlo.reshape %51 : (tensor<1x1x1xf32>) -> tensor<f32>
    %53 = stablehlo.slice %25 [5:6] : (tensor<8xf32>) -> tensor<1xf32>
    %54 = stablehlo.reshape %53 : (tensor<1xf32>) -> tensor<f32>
    %55 = quantum.extract %28[ 5] : !quantum.reg -> !quantum.bit
    %56 = stablehlo.convert %54 : (tensor<f32>) -> tensor<f64>
    %extracted_14 = tensor.extract %56[] : tensor<f64>
    %out_qubits_15 = quantum.custom "RY"(%extracted_14) %55 : !quantum.bit
    %57 = stablehlo.convert %52 : (tensor<f32>) -> tensor<f64>
    %extracted_16 = tensor.extract %57[] : tensor<f64>
    %out_qubits_17 = quantum.custom "RZ"(%extracted_16) %out_qubits_15 : !quantum.bit
    %58 = stablehlo.convert %50 : (tensor<f32>) -> tensor<f64>
    %extracted_18 = tensor.extract %58[] : tensor<f64>
    %out_qubits_19 = quantum.custom "RY"(%extracted_18) %out_qubits_17 : !quantum.bit
    %59 = stablehlo.convert %48 : (tensor<f32>) -> tensor<f64>
    %extracted_20 = tensor.extract %59[] : tensor<f64>
    %out_qubits_21 = quantum.custom "RZ"(%extracted_20) %out_qubits_19 : !quantum.bit
    %60 = stablehlo.slice %arg0 [0:1, 4:5, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %61 = stablehlo.reshape %60 : (tensor<1x1x1xf32>) -> tensor<f32>
    %62 = stablehlo.slice %arg0 [0:1, 4:5, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %63 = stablehlo.reshape %62 : (tensor<1x1x1xf32>) -> tensor<f32>
    %64 = stablehlo.slice %arg0 [0:1, 4:5, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %65 = stablehlo.reshape %64 : (tensor<1x1x1xf32>) -> tensor<f32>
    %66 = stablehlo.slice %25 [4:5] : (tensor<8xf32>) -> tensor<1xf32>
    %67 = stablehlo.reshape %66 : (tensor<1xf32>) -> tensor<f32>
    %68 = quantum.extract %28[ 4] : !quantum.reg -> !quantum.bit
    %69 = stablehlo.convert %67 : (tensor<f32>) -> tensor<f64>
    %extracted_22 = tensor.extract %69[] : tensor<f64>
    %out_qubits_23 = quantum.custom "RY"(%extracted_22) %68 : !quantum.bit
    %70 = stablehlo.convert %65 : (tensor<f32>) -> tensor<f64>
    %extracted_24 = tensor.extract %70[] : tensor<f64>
    %out_qubits_25 = quantum.custom "RZ"(%extracted_24) %out_qubits_23 : !quantum.bit
    %71 = stablehlo.convert %63 : (tensor<f32>) -> tensor<f64>
    %extracted_26 = tensor.extract %71[] : tensor<f64>
    %out_qubits_27 = quantum.custom "RY"(%extracted_26) %out_qubits_25 : !quantum.bit
    %72 = stablehlo.convert %61 : (tensor<f32>) -> tensor<f64>
    %extracted_28 = tensor.extract %72[] : tensor<f64>
    %out_qubits_29 = quantum.custom "RZ"(%extracted_28) %out_qubits_27 : !quantum.bit
    %73 = stablehlo.slice %arg0 [0:1, 3:4, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %74 = stablehlo.reshape %73 : (tensor<1x1x1xf32>) -> tensor<f32>
    %75 = stablehlo.slice %arg0 [0:1, 3:4, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %76 = stablehlo.reshape %75 : (tensor<1x1x1xf32>) -> tensor<f32>
    %77 = stablehlo.slice %arg0 [0:1, 3:4, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %78 = stablehlo.reshape %77 : (tensor<1x1x1xf32>) -> tensor<f32>
    %79 = stablehlo.slice %25 [3:4] : (tensor<8xf32>) -> tensor<1xf32>
    %80 = stablehlo.reshape %79 : (tensor<1xf32>) -> tensor<f32>
    %81 = quantum.extract %28[ 3] : !quantum.reg -> !quantum.bit
    %82 = stablehlo.convert %80 : (tensor<f32>) -> tensor<f64>
    %extracted_30 = tensor.extract %82[] : tensor<f64>
    %out_qubits_31 = quantum.custom "RY"(%extracted_30) %81 : !quantum.bit
    %83 = stablehlo.convert %78 : (tensor<f32>) -> tensor<f64>
    %extracted_32 = tensor.extract %83[] : tensor<f64>
    %out_qubits_33 = quantum.custom "RZ"(%extracted_32) %out_qubits_31 : !quantum.bit
    %84 = stablehlo.convert %76 : (tensor<f32>) -> tensor<f64>
    %extracted_34 = tensor.extract %84[] : tensor<f64>
    %out_qubits_35 = quantum.custom "RY"(%extracted_34) %out_qubits_33 : !quantum.bit
    %85 = stablehlo.convert %74 : (tensor<f32>) -> tensor<f64>
    %extracted_36 = tensor.extract %85[] : tensor<f64>
    %out_qubits_37 = quantum.custom "RZ"(%extracted_36) %out_qubits_35 : !quantum.bit
    %86 = stablehlo.slice %arg0 [0:1, 2:3, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %87 = stablehlo.reshape %86 : (tensor<1x1x1xf32>) -> tensor<f32>
    %88 = stablehlo.slice %arg0 [0:1, 2:3, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %89 = stablehlo.reshape %88 : (tensor<1x1x1xf32>) -> tensor<f32>
    %90 = stablehlo.slice %arg0 [0:1, 2:3, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %91 = stablehlo.reshape %90 : (tensor<1x1x1xf32>) -> tensor<f32>
    %92 = stablehlo.slice %25 [2:3] : (tensor<8xf32>) -> tensor<1xf32>
    %93 = stablehlo.reshape %92 : (tensor<1xf32>) -> tensor<f32>
    %94 = quantum.extract %28[ 2] : !quantum.reg -> !quantum.bit
    %95 = stablehlo.convert %93 : (tensor<f32>) -> tensor<f64>
    %extracted_38 = tensor.extract %95[] : tensor<f64>
    %out_qubits_39 = quantum.custom "RY"(%extracted_38) %94 : !quantum.bit
    %96 = stablehlo.convert %91 : (tensor<f32>) -> tensor<f64>
    %extracted_40 = tensor.extract %96[] : tensor<f64>
    %out_qubits_41 = quantum.custom "RZ"(%extracted_40) %out_qubits_39 : !quantum.bit
    %97 = stablehlo.convert %89 : (tensor<f32>) -> tensor<f64>
    %extracted_42 = tensor.extract %97[] : tensor<f64>
    %out_qubits_43 = quantum.custom "RY"(%extracted_42) %out_qubits_41 : !quantum.bit
    %98 = stablehlo.convert %87 : (tensor<f32>) -> tensor<f64>
    %extracted_44 = tensor.extract %98[] : tensor<f64>
    %out_qubits_45 = quantum.custom "RZ"(%extracted_44) %out_qubits_43 : !quantum.bit
    %99 = stablehlo.slice %arg0 [0:1, 0:1, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %100 = stablehlo.reshape %99 : (tensor<1x1x1xf32>) -> tensor<f32>
    %101 = stablehlo.slice %arg0 [0:1, 0:1, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %102 = stablehlo.reshape %101 : (tensor<1x1x1xf32>) -> tensor<f32>
    %103 = stablehlo.slice %arg0 [0:1, 0:1, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %104 = stablehlo.reshape %103 : (tensor<1x1x1xf32>) -> tensor<f32>
    %105 = stablehlo.slice %25 [0:1] : (tensor<8xf32>) -> tensor<1xf32>
    %106 = stablehlo.reshape %105 : (tensor<1xf32>) -> tensor<f32>
    %107 = quantum.extract %28[ 0] : !quantum.reg -> !quantum.bit
    %108 = stablehlo.convert %106 : (tensor<f32>) -> tensor<f64>
    %extracted_46 = tensor.extract %108[] : tensor<f64>
    %out_qubits_47 = quantum.custom "RY"(%extracted_46) %107 : !quantum.bit
    %109 = stablehlo.convert %104 : (tensor<f32>) -> tensor<f64>
    %extracted_48 = tensor.extract %109[] : tensor<f64>
    %out_qubits_49 = quantum.custom "RZ"(%extracted_48) %out_qubits_47 : !quantum.bit
    %110 = stablehlo.convert %102 : (tensor<f32>) -> tensor<f64>
    %extracted_50 = tensor.extract %110[] : tensor<f64>
    %out_qubits_51 = quantum.custom "RY"(%extracted_50) %out_qubits_49 : !quantum.bit
    %111 = stablehlo.convert %100 : (tensor<f32>) -> tensor<f64>
    %extracted_52 = tensor.extract %111[] : tensor<f64>
    %out_qubits_53 = quantum.custom "RZ"(%extracted_52) %out_qubits_51 : !quantum.bit
    %112 = stablehlo.slice %arg0 [0:1, 1:2, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %113 = stablehlo.reshape %112 : (tensor<1x1x1xf32>) -> tensor<f32>
    %114 = stablehlo.slice %arg0 [0:1, 1:2, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %115 = stablehlo.reshape %114 : (tensor<1x1x1xf32>) -> tensor<f32>
    %116 = stablehlo.slice %arg0 [0:1, 1:2, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %117 = stablehlo.reshape %116 : (tensor<1x1x1xf32>) -> tensor<f32>
    %118 = stablehlo.slice %25 [1:2] : (tensor<8xf32>) -> tensor<1xf32>
    %119 = stablehlo.reshape %118 : (tensor<1xf32>) -> tensor<f32>
    %120 = quantum.extract %28[ 1] : !quantum.reg -> !quantum.bit
    %121 = stablehlo.convert %119 : (tensor<f32>) -> tensor<f64>
    %extracted_54 = tensor.extract %121[] : tensor<f64>
    %out_qubits_55 = quantum.custom "RY"(%extracted_54) %120 : !quantum.bit
    %122 = stablehlo.convert %117 : (tensor<f32>) -> tensor<f64>
    %extracted_56 = tensor.extract %122[] : tensor<f64>
    %out_qubits_57 = quantum.custom "RZ"(%extracted_56) %out_qubits_55 : !quantum.bit
    %123 = stablehlo.convert %115 : (tensor<f32>) -> tensor<f64>
    %extracted_58 = tensor.extract %123[] : tensor<f64>
    %out_qubits_59 = quantum.custom "RY"(%extracted_58) %out_qubits_57 : !quantum.bit
    %124 = stablehlo.convert %113 : (tensor<f32>) -> tensor<f64>
    %extracted_60 = tensor.extract %124[] : tensor<f64>
    %out_qubits_61 = quantum.custom "RZ"(%extracted_60) %out_qubits_59 : !quantum.bit
    %out_qubits_62:2 = quantum.custom "CNOT"() %out_qubits_53, %out_qubits_61 : !quantum.bit, !quantum.bit
    %out_qubits_63:2 = quantum.custom "CNOT"() %out_qubits_62#1, %out_qubits_45 : !quantum.bit, !quantum.bit
    %out_qubits_64:2 = quantum.custom "CNOT"() %out_qubits_63#1, %out_qubits_37 : !quantum.bit, !quantum.bit
    %out_qubits_65:2 = quantum.custom "CNOT"() %out_qubits_64#1, %out_qubits_29 : !quantum.bit, !quantum.bit
    %out_qubits_66:2 = quantum.custom "CNOT"() %out_qubits_65#1, %out_qubits_21 : !quantum.bit, !quantum.bit
    %out_qubits_67:2 = quantum.custom "CNOT"() %out_qubits_66#1, %out_qubits_13 : !quantum.bit, !quantum.bit
    %out_qubits_68:2 = quantum.custom "CNOT"() %out_qubits_67#1, %out_qubits_5 : !quantum.bit, !quantum.bit
    %125 = stablehlo.convert %17 : (tensor<f32>) -> tensor<f64>
    %extracted_69 = tensor.extract %125[] : tensor<f64>
    %out_qubits_70 = quantum.custom "RZ"(%extracted_69) %out_qubits_68#0 : !quantum.bit
    %126 = stablehlo.convert %15 : (tensor<f32>) -> tensor<f64>
    %extracted_71 = tensor.extract %126[] : tensor<f64>
    %out_qubits_72 = quantum.custom "RY"(%extracted_71) %out_qubits_70 : !quantum.bit
    %127 = stablehlo.convert %13 : (tensor<f32>) -> tensor<f64>
    %extracted_73 = tensor.extract %127[] : tensor<f64>
    %out_qubits_74 = quantum.custom "RZ"(%extracted_73) %out_qubits_72 : !quantum.bit
    %128 = stablehlo.slice %arg0 [1:2, 4:5, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %129 = stablehlo.reshape %128 : (tensor<1x1x1xf32>) -> tensor<f32>
    %130 = stablehlo.slice %arg0 [1:2, 4:5, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %131 = stablehlo.reshape %130 : (tensor<1x1x1xf32>) -> tensor<f32>
    %132 = stablehlo.slice %arg0 [1:2, 4:5, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %133 = stablehlo.reshape %132 : (tensor<1x1x1xf32>) -> tensor<f32>
    %134 = stablehlo.convert %133 : (tensor<f32>) -> tensor<f64>
    %extracted_75 = tensor.extract %134[] : tensor<f64>
    %out_qubits_76 = quantum.custom "RZ"(%extracted_75) %out_qubits_66#0 : !quantum.bit
    %135 = stablehlo.convert %131 : (tensor<f32>) -> tensor<f64>
    %extracted_77 = tensor.extract %135[] : tensor<f64>
    %out_qubits_78 = quantum.custom "RY"(%extracted_77) %out_qubits_76 : !quantum.bit
    %136 = stablehlo.convert %129 : (tensor<f32>) -> tensor<f64>
    %extracted_79 = tensor.extract %136[] : tensor<f64>
    %out_qubits_80 = quantum.custom "RZ"(%extracted_79) %out_qubits_78 : !quantum.bit
    %137 = stablehlo.slice %arg0 [1:2, 0:1, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %138 = stablehlo.reshape %137 : (tensor<1x1x1xf32>) -> tensor<f32>
    %139 = stablehlo.slice %arg0 [1:2, 0:1, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %140 = stablehlo.reshape %139 : (tensor<1x1x1xf32>) -> tensor<f32>
    %141 = stablehlo.slice %arg0 [1:2, 0:1, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %142 = stablehlo.reshape %141 : (tensor<1x1x1xf32>) -> tensor<f32>
    %out_qubits_81:2 = quantum.custom "CNOT"() %out_qubits_68#1, %out_qubits_62#0 : !quantum.bit, !quantum.bit
    %143 = stablehlo.convert %142 : (tensor<f32>) -> tensor<f64>
    %extracted_82 = tensor.extract %143[] : tensor<f64>
    %out_qubits_83 = quantum.custom "RZ"(%extracted_82) %out_qubits_81#1 : !quantum.bit
    %144 = stablehlo.convert %140 : (tensor<f32>) -> tensor<f64>
    %extracted_84 = tensor.extract %144[] : tensor<f64>
    %out_qubits_85 = quantum.custom "RY"(%extracted_84) %out_qubits_83 : !quantum.bit
    %145 = stablehlo.convert %138 : (tensor<f32>) -> tensor<f64>
    %extracted_86 = tensor.extract %145[] : tensor<f64>
    %out_qubits_87 = quantum.custom "RZ"(%extracted_86) %out_qubits_85 : !quantum.bit
    %146 = stablehlo.slice %arg0 [1:2, 2:3, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %147 = stablehlo.reshape %146 : (tensor<1x1x1xf32>) -> tensor<f32>
    %148 = stablehlo.slice %arg0 [1:2, 2:3, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %149 = stablehlo.reshape %148 : (tensor<1x1x1xf32>) -> tensor<f32>
    %150 = stablehlo.slice %arg0 [1:2, 2:3, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %151 = stablehlo.reshape %150 : (tensor<1x1x1xf32>) -> tensor<f32>
    %152 = stablehlo.convert %151 : (tensor<f32>) -> tensor<f64>
    %extracted_88 = tensor.extract %152[] : tensor<f64>
    %out_qubits_89 = quantum.custom "RZ"(%extracted_88) %out_qubits_64#0 : !quantum.bit
    %153 = stablehlo.convert %149 : (tensor<f32>) -> tensor<f64>
    %extracted_90 = tensor.extract %153[] : tensor<f64>
    %out_qubits_91 = quantum.custom "RY"(%extracted_90) %out_qubits_89 : !quantum.bit
    %154 = stablehlo.convert %147 : (tensor<f32>) -> tensor<f64>
    %extracted_92 = tensor.extract %154[] : tensor<f64>
    %out_qubits_93 = quantum.custom "RZ"(%extracted_92) %out_qubits_91 : !quantum.bit
    %out_qubits_94:2 = quantum.custom "CNOT"() %out_qubits_87, %out_qubits_93 : !quantum.bit, !quantum.bit
    %out_qubits_95:2 = quantum.custom "CNOT"() %out_qubits_94#1, %out_qubits_80 : !quantum.bit, !quantum.bit
    %out_qubits_96:2 = quantum.custom "CNOT"() %out_qubits_95#1, %out_qubits_74 : !quantum.bit, !quantum.bit
    %out_qubits_97:2 = quantum.custom "CNOT"() %out_qubits_96#1, %out_qubits_94#0 : !quantum.bit, !quantum.bit
    %155 = stablehlo.convert %11 : (tensor<f32>) -> tensor<f64>
    %extracted_98 = tensor.extract %155[] : tensor<f64>
    %out_qubits_99 = quantum.custom "RZ"(%extracted_98) %out_qubits_97#1 : !quantum.bit
    %156 = stablehlo.convert %9 : (tensor<f32>) -> tensor<f64>
    %extracted_100 = tensor.extract %156[] : tensor<f64>
    %out_qubits_101 = quantum.custom "RY"(%extracted_100) %out_qubits_99 : !quantum.bit
    %157 = stablehlo.convert %7 : (tensor<f32>) -> tensor<f64>
    %extracted_102 = tensor.extract %157[] : tensor<f64>
    %out_qubits_103 = quantum.custom "RZ"(%extracted_102) %out_qubits_101 : !quantum.bit
    %158 = stablehlo.slice %arg0 [2:3, 3:4, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %159 = stablehlo.reshape %158 : (tensor<1x1x1xf32>) -> tensor<f32>
    %160 = stablehlo.slice %arg0 [2:3, 3:4, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %161 = stablehlo.reshape %160 : (tensor<1x1x1xf32>) -> tensor<f32>
    %162 = stablehlo.slice %arg0 [2:3, 3:4, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %163 = stablehlo.reshape %162 : (tensor<1x1x1xf32>) -> tensor<f32>
    %164 = stablehlo.slice %arg0 [1:2, 5:6, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %165 = stablehlo.reshape %164 : (tensor<1x1x1xf32>) -> tensor<f32>
    %166 = stablehlo.slice %arg0 [1:2, 5:6, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %167 = stablehlo.reshape %166 : (tensor<1x1x1xf32>) -> tensor<f32>
    %168 = stablehlo.slice %arg0 [1:2, 5:6, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %169 = stablehlo.reshape %168 : (tensor<1x1x1xf32>) -> tensor<f32>
    %170 = stablehlo.convert %169 : (tensor<f32>) -> tensor<f64>
    %extracted_104 = tensor.extract %170[] : tensor<f64>
    %out_qubits_105 = quantum.custom "RZ"(%extracted_104) %out_qubits_67#0 : !quantum.bit
    %171 = stablehlo.convert %167 : (tensor<f32>) -> tensor<f64>
    %extracted_106 = tensor.extract %171[] : tensor<f64>
    %out_qubits_107 = quantum.custom "RY"(%extracted_106) %out_qubits_105 : !quantum.bit
    %172 = stablehlo.convert %165 : (tensor<f32>) -> tensor<f64>
    %extracted_108 = tensor.extract %172[] : tensor<f64>
    %out_qubits_109 = quantum.custom "RZ"(%extracted_108) %out_qubits_107 : !quantum.bit
    %173 = stablehlo.slice %arg0 [1:2, 1:2, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %174 = stablehlo.reshape %173 : (tensor<1x1x1xf32>) -> tensor<f32>
    %175 = stablehlo.slice %arg0 [1:2, 1:2, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %176 = stablehlo.reshape %175 : (tensor<1x1x1xf32>) -> tensor<f32>
    %177 = stablehlo.slice %arg0 [1:2, 1:2, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %178 = stablehlo.reshape %177 : (tensor<1x1x1xf32>) -> tensor<f32>
    %179 = stablehlo.convert %178 : (tensor<f32>) -> tensor<f64>
    %extracted_110 = tensor.extract %179[] : tensor<f64>
    %out_qubits_111 = quantum.custom "RZ"(%extracted_110) %out_qubits_63#0 : !quantum.bit
    %180 = stablehlo.convert %176 : (tensor<f32>) -> tensor<f64>
    %extracted_112 = tensor.extract %180[] : tensor<f64>
    %out_qubits_113 = quantum.custom "RY"(%extracted_112) %out_qubits_111 : !quantum.bit
    %181 = stablehlo.convert %174 : (tensor<f32>) -> tensor<f64>
    %extracted_114 = tensor.extract %181[] : tensor<f64>
    %out_qubits_115 = quantum.custom "RZ"(%extracted_114) %out_qubits_113 : !quantum.bit
    %182 = stablehlo.slice %arg0 [1:2, 3:4, 2:3] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %183 = stablehlo.reshape %182 : (tensor<1x1x1xf32>) -> tensor<f32>
    %184 = stablehlo.slice %arg0 [1:2, 3:4, 1:2] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %185 = stablehlo.reshape %184 : (tensor<1x1x1xf32>) -> tensor<f32>
    %186 = stablehlo.slice %arg0 [1:2, 3:4, 0:1] : (tensor<4x8x3xf32>) -> tensor<1x1x1xf32>
    %187 = stablehlo.reshape %186 : (tensor<1x1x1xf32>) -> tensor<f32>
    %188 = stablehlo.convert %187 : (tensor<f32>) -> tensor<f64>
    %extracted_116 = tensor.extract %188[] : tensor<f64>
    %out_qubits_117 = quantum.custom "RZ"(%extracted_116) %out_qubits_65#0 : !quantum.bit
    %189 = stablehlo.convert %185 : (tensor<f32>) -> tensor<f64>
    %extracted_118 = tensor.extract %189[] : tensor<f64>
    %out_qubits_119 = quantum.custom "RY"(%extracted_118) %out_qubits_117 : !quantum.bit
    %190 = stablehlo.convert %183 : (tensor<f32>) -> tensor<f64>
    %extracted_120 = tensor.extract %190[] : tensor<f64>
    %out_qubits_121 = quantum.custom "RZ"(%extracted_120) %out_qubits_119 : !quantum.bit
    %out_qubits_122:2 = quantum.custom "CNOT"() %out_qubits_115, %out_qubits_121 : !quantum.bit, !quantum.bit
    %out_qubits_123:2 = quantum.custom "CNOT"() %out_qubits_122#1, %out_qubits_109 : !quantum.bit, !quantum.bit
    %191 = stablehlo.convert %163 : (tensor<f32>) -> tensor<f64>
    %extracted_124 = tensor.extract %191[] : tensor<f64>
    %out_qubits_125 = quantum.custom "RZ"(%extracted_124) %out_qubits_123#0 : !quantum.bit
    %192 = stablehlo.convert %161 : (tensor<f32>) -> tensor<f64>
    %extracted_126 = tensor.extract %192[] : tensor<f64>
    %out_qubits_127 = quantum.custom "RY"(%extracted_126) %out_qubits_125 : !quantum.bit
    %193 = stablehlo.convert %159 : (tensor<f32>) -> tensor<f64>
    %extracted_128 = tensor.extract %193[] : tensor<f64>
    %out_qubits_129 = quantum.custom "RZ"(%extracted_128) %out_qubits_127 : !quantum.bit
